
# ======================================
# 1. Создание переменных и вывод значений
# ============================
name = "Алина"
age = 36
heigh = 1.68

print("Имя:", name)
print("Возраст:", age, "лет")
print("Рост:", heigh)

# ======================================
# 2. Изменение значений переменных
# ======================================
x = 10
print(type(x))
x = 25.5
print(type(x))
x = "Python"
print(x)
print(type(x))

# ======================================
# 3. Копирование ссылок
# ======================================

a = 7
b = a
print(a)
print(b)
a = 10
print(a)
print(b)
# значение переменной "b" не изменилось,так как в самом начале a = 7 и "b" ссылалась на тот же обьект, что и переменная "a",далее переменная"а" присвоила значение 10 и теперь ссылается на него, а переменная "b" без изменений-ссылается на старый объект

# ======================================
# 4. Каскадное присваивание
# ======================================

x = y = z = 100
print(x)
print(y)
print(z)
print(id(x))
print(id(y))    #Одинаковые id
print(id(z))

x, y, z = 20, 70, 98
print(x)
print(y)
print(z)
print(id(x))
print(id(y))    #Разные id
print(id(z))

# ======================================
# 5. Обмен значений переменных
# ======================================

a = 5
b = 10
a , b = b, a
print(a, b)

# ======================================
# 6. Работа с именами переменных
# ======================================

# True, print, if    Переменные зарезервированными словами нельзя назвать,так как произойдет ошибка (SyntaxError: invalid syntax (неверный синтаксис)).

# список зарезервированных слов в Python с помощью:
import keyword
print(keyword.kwlist)

# ======================================
# 7. Использование функции type()
# ======================================

var1 = 42
var2 = 3.14
var3 = "Hello"
print(type(var1))
print(type(var2))
print(type(var3))

var1 = 'Лиссабон'
print(type(var1))

# ======================================
# 8. Дополнительные задания
# ======================================

user_name = "Alina"
eye_color = "Зеленые"
racket_weight_grams = 300
baggage_weight_kg = 21.5
belem_tower_visited = True
переменная = 10
print(переменная)   #Это работает

